Repository: ChiFungHillmanChan/macbook-resizer
Catalog: SceneApp/SceneApp/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hk, zh_tw

# common.error
source: Error
ja: エラー
zh_hk: 錯誤
zh_tw: 錯誤

# hotkeys.clear
source: Clear
ja: クリア
zh_hk: 清除
zh_tw: 清除

# hotkeys.conflict
source: This chord is already used by %@. Unbind it first or pick another.
ja: このショートカットは既に %@ で使用されています。先に解除するか、別のキーを選んでください。
zh_hk: %@ 已經用緊呢個快速鍵，要先解除或者揀過另一個。
zh_tw: %@ 已使用這個快速鍵，請先解除或選擇其他組合。

# hotkeys.record
source: Record
ja: 記録
zh_hk: 錄製
zh_tw: 錄製

# interaction.animation.duration
source: Duration
ja: 時間
zh_hk: 時長
zh_tw: 時間

# interaction.animation.easing
source: Easing
ja: イージング
zh_hk: 緩動
zh_tw: 緩動

# interaction.animation.easing.ease_out
source: Ease Out
ja: イーズアウト
zh_hk: 漸慢
zh_tw: 漸慢

# interaction.animation.easing.linear
source: Linear
ja: リニア
zh_hk: 直線
zh_tw: 線性

# interaction.animation.easing.spring
source: Spring
ja: スプリング
zh_hk: 彈簧
zh_tw: 彈簧

# interaction.animation.enable
source: Enable smooth animation
ja: スムーズアニメーションを有効にする
zh_hk: 開啟順暢動畫
zh_tw: 啟用流暢動畫

# interaction.animation.preview
source: Preview
ja: プレビュー
zh_hk: 預覽
zh_tw: 預覽

# interaction.animation.preview.run
source: Run preview
ja: プレビューを再生
zh_hk: 播放預覽
zh_tw: 播放預覽

# interaction.animation.section
source: Animation
ja: アニメーション
zh_hk: 動畫
zh_tw: 動畫

# interaction.drag_swap.enable
source: Enable drag-to-swap
ja: ドラッグで入れ替えを有効にする
zh_hk: 開啟拖拉對調
zh_tw: 啟用拖曳交換

# interaction.drag_swap.hint
source: Hold ⌥ while dragging to temporarily bypass drag-to-swap.
ja: ドラッグ中に ⌥ を押し続けると、一時的にドラッグ交換をオフにできます。
zh_hk: 拖住嘅時候撳住 ⌥ 可以暫時唔啟用拖拉對調。
zh_tw: 拖曳時按住 ⌥ 可暫時跳過拖曳交換。

# interaction.drag_swap.section
source: Drag-to-Swap
ja: ドラッグで入れ替え
zh_hk: 拖拉對調
zh_tw: 拖曳交換

# interaction.drag_swap.threshold
source: Drag distance threshold
ja: ドラッグ距離のしきい値
zh_hk: 拖拉距離門檻
zh_tw: 拖曳距離門檻

# layouts.detail.empty
source: Select a layout or create a new one
ja: レイアウトを選ぶか、新しく作成してください
zh_hk: 撳一個排列嚟編輯，或者新增一個
zh_tw: 請選擇一個排列,或新增一個

# layouts.editor.name
source: Name
ja: 名前
zh_hk: 名稱
zh_tw: 名稱

# layouts.editor.template
source: Template
ja: テンプレート
zh_hk: 樣板
zh_tw: 範本

# layouts.modified
source: (modified)
ja: (変更あり)
zh_hk: （已修改）
zh_tw: (已修改)

# layouts.new.default_name
source: New Layout
ja: 新しいレイアウト
zh_hk: 新排列
zh_tw: 新排列

# layouts.restore_defaults
source: Restore Default Presets
ja: デフォルトプリセットを復元
zh_hk: 還原預設排列
zh_tw: 還原預設排列

# layouts.slider.column_divider
source: Column divider %lld
ja: 列の区切り %lld
zh_hk: 欄分隔線 %lld
zh_tw: 欄分隔線 %lld

# layouts.slider.column_split
source: Column split
ja: 列の分割
zh_hk: 欄切割
zh_tw: 欄分割

# layouts.slider.main_height
source: Main height
ja: メインの高さ
zh_hk: 主區高度
zh_tw: 主區高度

# layouts.slider.main_width
source: Main width
ja: メインの幅
zh_hk: 主區闊度
zh_tw: 主區寬度

# layouts.slider.pair_split
source: Pair split
ja: ペア分割
zh_hk: 配對切割
zh_tw: 配對分割

# layouts.slider.row_divider
source: Row divider %lld
ja: 行の区切り %lld
zh_hk: 列分隔線 %lld
zh_tw: 列分隔線 %lld

# layouts.slider.row_split
source: Row split
ja: 行の分割
zh_hk: 列切割
zh_tw: 列分割

# layouts.slider.stack_split
source: Stack split
ja: スタックの分割
zh_hk: 堆疊切割
zh_tw: 堆疊分割

# layouts.template.grid_2x2
source: 2 × 2 Grid
ja: 2 × 2 グリッド
zh_hk: 2 × 2 格
zh_tw: 2 × 2 格

# layouts.template.grid_3x2
source: 3 × 2 Grid
ja: 3 × 2 グリッド
zh_hk: 3 × 2 格
zh_tw: 3 × 2 格

# layouts.template.l_bottom
source: L-shape (Main Bottom)
ja: L 字(メイン下)
zh_hk: L 形（主區喺底）
zh_tw: L 形(主區在下)

# layouts.template.l_left
source: L-shape (Main Left)
ja: L 字(メイン左)
zh_hk: L 形（主區喺左）
zh_tw: L 形(主區在左)

# layouts.template.l_right
source: L-shape (Main Right)
ja: L 字(メイン右)
zh_hk: L 形（主區喺右）
zh_tw: L 形(主區在右)

# layouts.template.l_top
source: L-shape (Main Top)
ja: L 字(メイン上)
zh_hk: L 形（主區喺頂）
zh_tw: L 形(主區在上)

# layouts.template.single
source: Single
ja: シングル
zh_hk: 單一
zh_tw: 單一

# layouts.template.three_col
source: 3 Columns
ja: 3 列
zh_hk: 3 欄
zh_tw: 3 欄

# layouts.template.three_row
source: 3 Rows
ja: 3 行
zh_hk: 3 列
zh_tw: 3 列

# layouts.template.two_col
source: 2 Columns
ja: 2 列
zh_hk: 2 欄
zh_tw: 2 欄

# layouts.template.two_row
source: 2 Rows
ja: 2 行
zh_hk: 2 列
zh_tw: 2 列

# menu.grant_accessibility
source: Grant Accessibility Access…
ja: アクセシビリティのアクセスを許可…
zh_hk: 授權輔助使用…
zh_tw: 授權輔助使用…

# menu.quit
source: Quit Scene
ja: Scene を終了
zh_hk: 結束 Scene
zh_tw: 結束 Scene

# menu.section.workspaces
source: Workspaces
ja: ワークスペース
zh_hk: 情境
zh_tw: 工作空間

# menu.settings
source: Settings…
ja: 設定…
zh_hk: 設定…
zh_tw: 設定…

# menu.workspaces.empty
source: No Workspaces yet
ja: ワークスペースがまだありません
zh_hk: 仲未有情境
zh_tw: 尚未建立工作空間

# notification.no_windows
source: No windows to arrange
ja: 配置するウィンドウがありません
zh_hk: 冇視窗好排
zh_tw: 沒有可排列的視窗

# onboarding.accessibility.body
source: To resize and rearrange your windows, Scene needs permission to control other apps. Click below to open System Settings, then enable Scene under Privacy & Security → Accessibility. Already granted? After each update, toggle Scene OFF then ON to refresh the grant.
ja: ウィンドウのサイズ変更と再配置を行うため、Scene は他のアプリを制御する権限が必要です。 下のボタンでシステム設定を開き、「プライバシーとセキュリティ → アクセシビリティ」で Scene を有効にしてください。 すでに許可済みですか？アップデートのたびに、スイッチを一度 OFF にしてから再度 ON にして許可を更新してください。
zh_hk: 要重新調整同排視窗，Scene 要有權限控制其他 App。 撳下面嘅掣開「系統設定」，喺「私隱與保安 → 輔助使用」度打開 Scene。 已經畀咗權限？每次升級 Scene 之後，撳 toggle OFF 再撳 ON 先會認到新版本。
zh_tw: 為了調整並重新排列視窗，Scene 需要控制其他 App 的權限。 請按下方按鈕開啟「系統設定」，並在「隱私權與安全性 → 輔助使用」中啟用 Scene。 已經授權？每次更新 Scene 後，請把開關切到 OFF 再切回 ON 以重新確認。

# onboarding.accessibility.check_again
source: Check again
ja: 再確認
zh_hk: 再檢查
zh_tw: 再次檢查

# onboarding.accessibility.open_settings
source: Open System Settings
ja: システム設定を開く
zh_hk: 開啟系統設定
zh_tw: 開啟系統設定

# onboarding.accessibility.still_not_detected.body
source: If Scene is already in the Accessibility list, toggle it OFF then back ON — macOS requires re-confirming access after each update. If that fails, quit Scene and reopen.
ja: アクセシビリティのリストに Scene がすでにある場合は、スイッチを一度 OFF にしてから再度 ON にしてください（macOS はアップデートごとに権限の再確認が必要です）。それでもだめな場合は Scene を終了して開き直してください。
zh_hk: 如果 Scene 已經喺輔助使用 list 入面，撳個 toggle OFF 再撳 ON — macOS 每次升級都要 confirm 多次權限。如果仲係唔得，結束 Scene 再開過。
zh_tw: 如果 Scene 已在輔助使用清單中，請把開關切到 OFF 再切回 ON — macOS 每次更新後都需重新確認權限。仍無法偵測請結束 Scene 再開啟。

# onboarding.accessibility.still_not_detected.title
source: Still not detected?
ja: まだ検出されませんか?
zh_hk: 仲係偵測唔到？
zh_tw: 仍然無法偵測?

# onboarding.accessibility.title
source: Scene needs Accessibility access
ja: Scene にアクセシビリティ権限が必要です
zh_hk: Scene 要有輔助使用權限
zh_tw: Scene 需要輔助使用權限

# onboarding.calendar.body
source: Scene needs calendar access to fire calendar-based Workspace triggers.
ja: カレンダーを使ったワークスペーストリガーを実行するため、Scene はカレンダーへのアクセスが必要です。
zh_hk: Scene 需要存取日曆先可以喺事件開始時自動啟動情境。
zh_tw: Scene 需要存取行事曆,才能在事件開始時觸發工作空間。

# onboarding.calendar.grant
source: Grant access
ja: アクセスを許可
zh_hk: 授權
zh_tw: 授權存取

# onboarding.calendar.title
source: Calendar access
ja: カレンダーへのアクセス
zh_hk: 日曆存取
zh_tw: 行事曆存取

# settings.action.cancel
source: Cancel
ja: キャンセル
zh_hk: 取消
zh_tw: 取消

# settings.action.delete
source: Delete
ja: 削除
zh_hk: 刪除
zh_tw: 刪除

# settings.action.reset
source: Reset to Default
ja: デフォルトに戻す
zh_hk: 還原預設
zh_tw: 還原預設

# settings.action.save
source: Save
ja: 保存
zh_hk: 儲存
zh_tw: 儲存

# settings.tab.about
source: About
ja: 情報
zh_hk: 關於
zh_tw: 關於

# settings.tab.hotkeys
source: Hotkeys
ja: ショートカット
zh_hk: 快速鍵
zh_tw: 快速鍵

# settings.tab.interaction
source: Interaction
ja: インタラクション
zh_hk: 互動
zh_tw: 互動

# settings.tab.layouts
source: Layouts
ja: レイアウト
zh_hk: 排列
zh_tw: 排列

# settings.tab.workspaces
source: Workspaces
ja: ワークスペース
zh_hk: 情境
zh_tw: 工作空間

# settings.window.title
source: Scene Settings
ja: Scene 設定
zh_hk: Scene 設定
zh_tw: Scene 設定

# trigger.add.button
source: + Add trigger
ja: + トリガーを追加
zh_hk: + 加觸發條件
zh_tw: + 新增觸發條件

# trigger.add.kind
source: Add
ja: 種類
zh_hk: 新增類型
zh_tw: 新增類型

# trigger.calendar.contains
source: When calendar event title contains
ja: カレンダーイベントのタイトルに含まれるとき
zh_hk: 日曆事件標題包含
zh_tw: 當行事曆事件標題包含

# trigger.calendar.denied_hint
source: Scene needs Calendar access to use this trigger. Grant in System Settings.
ja: このトリガーを使うにはカレンダーへのアクセス許可が必要です。システム設定から許可してください。
zh_hk: Scene 要日曆權限先用到呢種觸發。去系統設定度開畀佢。
zh_tw: Scene 需要行事曆權限才能使用此觸發。請於系統設定授權。

# trigger.calendar.keyword
source: Keyword
ja: キーワード
zh_hk: 關鍵字
zh_tw: 關鍵字

# trigger.kind.calendar_event
source: Calendar event
ja: カレンダーイベント
zh_hk: 日曆事件
zh_tw: 行事曆事件

# trigger.kind.manual
source: Manual only
ja: 手動のみ
zh_hk: 淨係手動
zh_tw: 僅手動

# trigger.kind.monitor_connect
source: Monitor connected
ja: モニター接続時
zh_hk: 駁上 Monitor
zh_tw: 連接螢幕時

# trigger.kind.monitor_disconnect
source: Monitor disconnected
ja: モニター切断時
zh_hk: 拔走 Monitor
zh_tw: 拔除螢幕時

# trigger.kind.time_of_day
source: Time of day
ja: 指定時刻
zh_hk: 指定時間
zh_tw: 指定時間

# trigger.manual.description
source: Manual — activate via hotkey or menu click
ja: 手動 — ショートカットまたはメニューから起動
zh_hk: 手動 — 撳快速鍵或者 menu bar 啟動
zh_tw: 手動 — 透過快速鍵或選單啟動

# trigger.monitor_connect.label
source: When connecting
ja: 接続時
zh_hk: 駁上嘅時候
zh_tw: 連接時

# trigger.monitor_disconnect.label
source: When disconnecting
ja: 切断時
zh_hk: 拔走嘅時候
zh_tw: 拔除時

# trigger.none
source: No triggers yet — this Workspace activates only manually.
ja: まだトリガーがありません — このワークスペースは手動でのみ起動します。
zh_hk: 仲未有觸發條件 — 呢個情境只可以手動啟動。
zh_tw: 尚無觸發條件 — 此工作空間僅能手動啟動。

# trigger.remove
source: Remove trigger
ja: トリガーを削除
zh_hk: 移除觸發條件
zh_tw: 移除觸發條件

# trigger.time_of_day.at
source: At
ja: 時刻
zh_hk: 喺
zh_tw: 於

# trigger.time_of_day.days
source: Days
ja: 曜日
zh_hk: 日子
zh_tw: 星期

# weekday.fri.short
source: Fr
ja: 金
zh_hk: 五
zh_tw: 五

# weekday.mon.short
source: Mo
ja: 月
zh_hk: 一
zh_tw: 一

# weekday.sat.short
source: Sa
ja: 土
zh_hk: 六
zh_tw: 六

# weekday.sun.short
source: Su
ja: 日
zh_hk: 日
zh_tw: 日

# weekday.thu.short
source: Th
ja: 木
zh_hk: 四
zh_tw: 四

# weekday.tue.short
source: Tu
ja: 火
zh_hk: 二
zh_tw: 二

# weekday.wed.short
source: We
ja: 水
zh_hk: 三
zh_tw: 三

# workspace.activated.body
source: Activated %@
ja: %@ を起動しました
zh_hk: 已啟動 %@ 情境
zh_tw: 已啟動 %@ 工作空間

# workspace.editor.apps.add
source: Add…
ja: 追加…
zh_hk: 新增…
zh_tw: 新增…

# workspace.editor.apps.remove
source: Remove app
ja: アプリを削除
zh_hk: 移除程式
zh_tw: 移除應用程式

# workspace.editor.apps.search
source: Search
ja: 検索
zh_hk: 搵程式
zh_tw: 搜尋

# workspace.editor.apps_to_launch
source: Apps to Launch
ja: 起動するアプリ
zh_hk: 啟動時開
zh_tw: 啟動時開啟

# workspace.editor.apps_to_quit
source: Apps to Quit
ja: 終了するアプリ
zh_hk: 啟動時關
zh_tw: 啟動時關閉

# workspace.editor.error.hotkey_conflict
source: Hotkey already used by %@
ja: ショートカットは既に %@ で使用されています
zh_hk: %@ 已經用緊呢個快速鍵
zh_tw: %@ 已使用此快速鍵

# workspace.editor.error.not_found
source: Workspace %@ no longer exists
ja: ワークスペース %@ は存在しません
zh_hk: 情境 %@ 已經冇咗
zh_tw: 工作空間 %@ 已不存在

# workspace.editor.focus.hint
source: Create matching Shortcuts in the Shortcuts app. Scene will run them on activation / deactivation.
ja: ショートカット App で対応するショートカットを作成してください。Scene は起動時/終了時に実行します。
zh_hk: 去 Shortcuts App 整對應嘅捷徑；Scene 會喺切換時行佢。
zh_tw: 請在「捷徑」App 建立對應的捷徑;Scene 會在切換時執行。

# workspace.editor.focus.shortcut_off
source: Focus Off Shortcut
ja: 集中モード オフのショートカット
zh_hk: 結束時嘅 Shortcut
zh_tw: 結束時的捷徑

# workspace.editor.focus.shortcut_on
source: Focus On Shortcut
ja: 集中モード オンのショートカット
zh_hk: 啟動時嘅 Shortcut
zh_tw: 啟動時的捷徑

# workspace.editor.hotkey
source: Hotkey
ja: ショートカット
zh_hk: 快速鍵
zh_tw: 快速鍵

# workspace.editor.hotkey.cancel
source: Cancel
ja: キャンセル
zh_hk: 取消
zh_tw: 取消

# workspace.editor.hotkey.clear
source: Clear
ja: クリア
zh_hk: 清除
zh_tw: 清除

# workspace.editor.hotkey.none
source: None
ja: なし
zh_hk: 未設定
zh_tw: 未設定

# workspace.editor.hotkey.record
source: Record
ja: 記録
zh_hk: 錄製
zh_tw: 錄製

# workspace.editor.layout
source: Layout
ja: レイアウト
zh_hk: 排列
zh_tw: 排列

# workspace.editor.layout.missing
source: Layout missing — please pick again
ja: レイアウトがありません — 選び直してください
zh_hk: 排列唔見咗 — 要重新揀
zh_tw: 排列已遺失 — 請重新選擇

# workspace.editor.name
source: Name
ja: 名前
zh_hk: 名稱
zh_tw: 名稱

# workspace.editor.save
source: Save
ja: 保存
zh_hk: 儲存
zh_tw: 儲存

# workspace.editor.section.apps
source: Apps
ja: アプリ
zh_hk: 程式
zh_tw: 應用程式

# workspace.editor.section.basics
source: Basics
ja: 基本
zh_hk: 基本
zh_tw: 基本

# workspace.editor.section.focus
source: Focus Mode
ja: 集中モード
zh_hk: 專注模式
zh_tw: 專注模式

# workspace.editor.section.triggers
source: Triggers
ja: トリガー
zh_hk: 觸發條件
zh_tw: 觸發條件

# workspace.missing_layout.body
source: %@ references a deleted layout — please edit to pick again
ja: %@ は削除されたレイアウトを参照しています — 編集して選び直してください
zh_hk: %@ 指住已刪除嘅排列 — 要編輯重新揀
zh_tw: %@ 指向已刪除的排列 — 請編輯並重新選擇

# workspace.missing_layout.title
source: Workspace layout missing
ja: ワークスペースのレイアウトがありません
zh_hk: 情境嘅排列唔見咗
zh_tw: 工作空間的排列已遺失

# workspace.quit.partial.body
source: Still running: %@ (check for unsaved changes)
ja: まだ実行中:%@(未保存の変更がないか確認してください)
zh_hk: 仲開緊：%@（可能有未存嘅檔案）
zh_tw: 仍在執行:%@(請確認是否有未儲存的內容)

# workspace.quit.partial.title
source: Unable to quit all apps
ja: 一部のアプリを終了できませんでした
zh_hk: 有啲程式關唔到
zh_tw: 部分應用程式無法結束

# workspaces.detail.empty
source: Select a Workspace to edit
ja: 編集するワークスペースを選択してください
zh_hk: 撳左邊個情境嚟編輯
zh_tw: 請選擇要編輯的工作空間

# workspaces.duplicate
source: Duplicate
ja: 複製
zh_hk: 複製
zh_tw: 複製

# workspaces.new
source: New
ja: 新規
zh_hk: 新增
zh_tw: 新增

# workspaces.new.default_name
source: New Workspace
ja: 新しいワークスペース
zh_hk: 新情境
zh_tw: 新工作空間

# workspaces.new.disabled.hint
source: Create a Layout first — Workspaces require a Layout
ja: まずレイアウトを作成してください — ワークスペースにはレイアウトが必要です
zh_hk: 要先整返個排列 — 情境一定要有排列先得
zh_tw: 請先建立排列 — 工作空間必須有排列才能建立

# common.ok
source: OK
zh_hk: 好
zh_tw: 好

# interaction.animation.duration.max
source: 500ms
zh_hk: 500 毫秒
zh_tw: 500 毫秒

# interaction.animation.duration.min
source: 100ms
zh_hk: 100 毫秒
zh_tw: 100 毫秒

# interaction.animation.duration.value
source: %lldms
zh_hk: %lld 毫秒
zh_tw: %lld 毫秒

# interaction.drag_swap.threshold.max
source: 100pt
zh_hk: 100 點
zh_tw: 100 點

# interaction.drag_swap.threshold.min
source: 10pt
zh_hk: 10 點
zh_tw: 10 點

# interaction.drag_swap.threshold.value
source: %lldpt
zh_hk: %lld 點
zh_tw: %lld 點
